---
type: Settings
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# Settings

`Autodesk.Revit.DB.Settings` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Categories | — | `public Categories Categories { get ; }` |
| Property | ElectricalSetting | — | `public ElectricalSetting ElectricalSetting { get ; }` |
| Property | TilePatterns | — | `public TilePatterns TilePatterns { get ; }` |